# AnalyticalModelStartProjectionOrthogonal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelStartProjectionOrthogonal Property
ParameterTypeId Class See Also
---
"Start Projection Orthogonal"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelStartProjectionOrthogonal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelStartProjectionOrthogonal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelStartProjectionOrthogonal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace